skipruntime-ts/load_tests/simple.yml
config:
  target: http://localhost:8081/v1/streams/foo
  processor: ./helpers.js
  phases:
    - duration: 10
      arrivalRate: 1
  engines:
    sse: {}

scenarios:
  - name: 'reader'
    weight: 1
    engine: sse
    onMessage: handleSSEMessage
    flow:
      - open
      - log: opened
      - think
  - name: 'writer'
    weight: 10
    flow:
      - patch:
          url: 'http://localhost:8081/v1/inputs/foo'
          body: '[["foo", ["bar"]]]'
          headers:
            Content-Type: 'application/json'