skipruntime-ts/load_tests/simple.yml
config:
  processor: ./helpers.js
  phases:
    - duration: 1
      arrivalRate: 10
  engines:
    skip:
      control_url: http://localhost:8081
      stream_url: http://localhost:8080
  target: unused

scenarios:
  - name: replicate_simple_writes
    engine: skip
    flow:
      - stream:
          resource: foo
          onUpdate: onUpdate
      - log: "[VU {{ $uuid }}] connected"
      - loop:
          - write:
              collection: foo
              data:
                - ["{{ $uuid }}-{{ $loopCount }}", ["true"]]
              hook: writeHook
        count: 10
      - loop:
          - log: "[VU {{ $uuid }}] Writes replicated: {{ writes_replicated }} / {{ writes_issued }}"
          - think: 1
        whileTrue: allWritesReplicated
      - log: "[VU {{ $uuid }}] closing"
      - close