skipruntime-ts/load_tests/simple.yml
config:
  target: http://localhost:8080/v1/streams/posts
  processor: ./helpers.js
  phases:
    - duration: 10
      arrivalRate: 1
  engines:
    sse: {}

scenarios:
  - engine: sse
    onMessage: handleSSEMessage
    flow:
      - open
      - log: opened
      - loop
      - log: closing
      - close